{
  "project": "Installation & Update System",
  "branchName": "ralph/install-update-system",
  "description": "A vaibhav update command that works on both Termux and desktop, verifies success via version and checksum checks, and makes setup scripts idempotent.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Add VAIBHAV_VERSION and --version flag",
      "description": "As a user, I want vaibhav --version to reliably show the installed version so I can verify updates worked.",
      "acceptanceCriteria": [
        "VAIBHAV_VERSION variable is defined near the top of bin/vaibhav as the single source of truth",
        "vaibhav --version prints just the version string (e.g., 'vaibhav 0.3.0')",
        "vaibhav-ralph does not independently track a version — it defers to vaibhav --version",
        "Existing functionality of bin/vaibhav is not broken"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Create checksum generation script and checksums.sha256",
      "description": "As a maintainer, I want a checksums file in the repo so that Termux updates can verify file integrity.",
      "acceptanceCriteria": [
        "A script bin/generate-checksums exists and is executable",
        "Running bin/generate-checksums produces checksums.sha256 in the repo root",
        "checksums.sha256 contains SHA256 hashes for bin/vaibhav, bin/vaibhav-ralph, and tmux.conf",
        "The format is standard sha256sum output (hash followed by filename)",
        "Running the script again overwrites the file with current hashes (idempotent)"
      ],
      "priority": 2,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Add vaibhav update for desktop (git pull)",
      "description": "As a desktop user, I want to run vaibhav update so that vaibhav is updated via git pull in the repo directory.",
      "acceptanceCriteria": [
        "vaibhav update on the desktop runs git pull in the vaibhav repo directory",
        "The repo directory is resolved from the symlink at ~/bin/vaibhav (readlink -f, then two levels up from bin/vaibhav)",
        "Shows old version → new version after pulling",
        "If there are local changes that would conflict, warns the user and aborts (does not force-pull)",
        "If already up to date, prints 'Already up to date (v0.3.0)'",
        "Exit code is 0 on success, non-zero on failure"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Depends on US-001 for version variable"
    },
    {
      "id": "US-004",
      "title": "Add vaibhav update for Termux — download and verify local files",
      "description": "As a Termux user, I want vaibhav update to download and verify all vaibhav files from GitHub so my phone has the latest version.",
      "acceptanceCriteria": [
        "vaibhav update downloads the latest bin/vaibhav from GitHub raw URL and replaces ~/bin/vaibhav",
        "Also downloads and updates bin/vaibhav-ralph to ~/bin/vaibhav-ralph",
        "Downloads checksums.sha256 and verifies each downloaded file against it before replacing",
        "Downloads to temp files first (mktemp), verifies checksums, then moves into place (atomic update)",
        "Uses trap to clean up temp files on failure",
        "Uses Cache-Control: no-cache header on all curl requests to avoid stale CDN caches",
        "Shows old version → new version (e.g., '0.2.0 → 0.3.0')",
        "If already on the latest version, prints 'Already up to date (v0.3.0)' and exits cleanly",
        "If checksum verification fails, aborts the update, keeps old files in place, and prints an error",
        "Exit code is 0 on success, non-zero on failure"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Depends on US-001 for version and US-002 for checksums"
    },
    {
      "id": "US-005",
      "title": "Add vaibhav update Termux → desktop remote update via SSH",
      "description": "As a Termux user, I want vaibhav update to also update the desktop side so both environments stay in sync.",
      "acceptanceCriteria": [
        "After updating local files, vaibhav update SSHes to the desktop and runs git -C <repo-path> pull",
        "The repo path on the desktop is discovered by running readlink -f ~/bin/vaibhav on the desktop to find the repo root",
        "Uses existing VAIBHAV_SSH_HOST config for SSH connectivity",
        "Shows the desktop update result (e.g., 'Desktop updated: v0.2.0 → v0.3.0' or 'Desktop already up to date')",
        "If SSH to desktop fails, prints a warning but still considers the local update successful",
        "A --local flag skips the desktop update"
      ],
      "priority": 5,
      "passes": true,
      "notes": "Depends on US-004 for local Termux update logic"
    },
    {
      "id": "US-006",
      "title": "Make setup-termux.sh idempotent — SSH config and config defaults",
      "description": "As a Termux user, I want to re-run setup-termux.sh to repair or upgrade my installation without breaking anything.",
      "acceptanceCriteria": [
        "Re-running the script does not duplicate SSH config entries (detects existing '# vaibhav' block and skips or replaces)",
        "Re-running does not re-prompt for desktop hostname/username if config already exists (uses existing values as defaults, allows override)",
        "Script can be re-run with no arguments if config already exists (reads defaults from ~/.config/vaibhav/config)",
        "Re-running does not overwrite custom changes to ~/.termux/termux.properties beyond the extra-keys block",
        "All steps print clear skip/update/done status (e.g., '✓ SSH config already configured' vs '✓ SSH config updated')"
      ],
      "priority": 6,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-007",
      "title": "Make setup-desktop.sh idempotent",
      "description": "As a desktop user, I want to re-run setup-desktop.sh to repair or upgrade my installation without breaking anything.",
      "acceptanceCriteria": [
        "Re-running does not duplicate PATH entries in shell rc files",
        "vaibhav init is only run if config doesn't exist yet, or user explicitly confirms re-configuration",
        "Mosh prompt is skipped if mosh is already installed",
        "All steps print clear skip/update/done status"
      ],
      "priority": 7,
      "passes": false,
      "notes": ""
    }
  ]
}
